Revit 2027 API
ExternalServices.BuiltInExternalServices.HoleDefinitionService Property
 The external service to view and modify hole definition parameters.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId HoleDefinitionService { get; }
Public Shared ReadOnly Property HoleDefinitionService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ HoleDefinitionService {
	ExternalServiceId^ get ();
}
static member HoleDefinitionService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace